app/Controllers/Cart.php

SELECT *
FROM `products`
WHERE `products`.`id` = '2'
---
    public function view()
    {
        $cart = $this->cart->contents();
        $model = new Products();
        $productos = [];

        foreach ($cart as $item) {
            $producto = $model->find($item['id']);

INSERT INTO `order` (`fecha`, `userID`, `total_venta`, `tipoPagoId`, `tarjeta`) VALUES ('2024-06-28 00:20:34', '6', 12250, '1', '1787248385738975')
---
            ];

            if (!empty($datosOrder)) {
                $Order->insert($datosOrder);

INSERT INTO `order_details` (`orderID`, `productID`, `cantidad`, `price`) VALUES (11, '2', 1, 12250)
---
                    'cantidad' => $producto['qty'],
                    'price' => $producto['price'],
                ];
                $OrderDetail->insert($dataOrderDetail);

INSERT INTO `envio` (`orderID`, `direccion`, `ciudad`, `provincia`, `codPostal`, `metodoEnvio`, `precioEnvio`, `fecha`) VALUES (11, 'belgrano 251', 'corrientes', 'corrientes', '3400', '1', '4500.00', '2024-06-28 00:20:34')
---
                'precioEnvio' => $precioEnvio,
                'fecha' => date('Y-m-d H:i:s'),
            ];
            $enivo->insert($envioData);

SELECT *
FROM `order`
WHERE `order`.`id` = '11'
SELECT *
FROM `order_details`
WHERE `orderID` = '11'
SELECT *
FROM `envio`
WHERE `orderID` = '11'
 LIMIT 1
SELECT *
FROM `user`
WHERE `user`.`userID` = '6'
SELECT *
FROM `products`
WHERE `products`.`id` = '2'
---
    public function comprobante($orderId)
{
    $Order = new Order();
    $OrderDetail = new OrderDetail();
    $Envio = new Envio();
    $User = new Users(); // Supongamos que tienes un modelo User para los datos del usuario
    $Product = new Products(); // Supongamos que tienes un modelo Products para los datos del producto

    $order = $Order->find($orderId);
    $orderDetails = $OrderDetail->where('orderID', $orderId)->findAll();
    $envio = $Envio->where('orderID', $orderId)->first();
    $user = $User->find($order['userID']); // Obtenemos los datos del usuario
    // Obtenemos los nombres de los productos
    foreach ($orderDetails as &$detail) {
        $product = $Product->find($detail['productID']);