app/Controllers/gestion_catalogo.php

SELECT *
FROM `products`
WHERE `categoriaID` = '1'
AND `activado` = 1
AND `stock` > 0
ORDER BY `id` ASC
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `categoriaID` = '1'
AND `activado` = 1
AND `stock` > 0
---
    public function listado_productos($prodID) {
        $datos['titulo'] = 'listadoProductos';

        // Cargar el modelo
        $product = new Products();

        // Configuración de la paginación
        $perPage = 3; // Número de productos por página
        $page = $this->request->getVar('page') ? $this->request->getVar('page') : 1; // Página actual

        // Obtener productos para la página actual
        $datos['product'] = $product->where('categoriaID', $prodID)
                                    ->where('activado', 1)
                                    ->where('stock >', 0)
                                    ->orderBy('id', 'ASC')
                                    ->paginate($perPage, 'default', $page);