app/Controllers/Logica.php

SELECT *
FROM `products`
ORDER BY `id` ASC
---
  public function listadoP_index()
{
    $datos['titulo'] = 'listadoP';


    $productModel = new Products();

    $products = $productModel->orderBy('id', 'ASC')->findAll();

SELECT *
FROM `user`
ORDER BY `userID` ASC
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `user`
---
    public function listadoPerfiles_index(){
        $data['titulo'] = 'Listado de Perfiles';

        // Configurar la paginación
        $userModel = new Users();
        $perPage = 3; // Número de resultados por página
        $currentPage = $this->request->getVar('page') ? (int) $this->request->getVar('page') : 1;

        // Obtener los usuarios paginados
        $users = $userModel->orderBy('userID', 'ASC')->paginate($perPage);